Revit 2024 API
GroupTypeId.RouteAnalysis Property
 Route Analysis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ForgeTypeId RouteAnalysis { get; }
Visual Basic
Public Shared ReadOnly Property RouteAnalysis As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RouteAnalysis {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace